In [12]:
import pandas as pd

In [25]:
#Colonnes Une colonne unique de données.
s = pd.Series([10, 20, 30])

#DataFrame Un tableau complet, avec des lignes et des colonnes (comme un fichier Excel).

data = {
    'Nom': ['Alice', 'Bob', 'Charlie'],
    'Âge': [25, 30, 27],
    'Ville': ["Paris", "Marseille", "Nice"]
}
data2 = {
    'Nom': ['Alice', 'Bob', 'Charlie'],
    'Profession': ['Développeuse', 'Analyste', 'Designer'],
    'Salaire': [3200, 2800, 3000]
}

df2 = pd.DataFrame(data2)
df1 = pd.DataFrame(data)

# 1. Afficher la colonne Âge
df1['Âge']

# 2. Trier les personnes par âge
df1.sort_values(by='Âge')

# 3. Filtrer ceux qui ont 30 ans ou plus
df1[df1['Âge'] >= 30]

# 4. Moyenne d’âge par ville
df1.groupby('Ville').mean(numeric_only=True)

# 5. Fusionner les deux DataFrames sur la colonne "Nom"
df_merged = pd.merge(df1, df2, on='Nom')
df_merged

       Nom  Âge      Ville    Profession  Salaire
0    Alice   25      Paris  Développeuse     3200
1      Bob   30  Marseille      Analyste     2800
2  Charlie   27       Nice      Designer     3000

In [26]:
data = {
    'Book Title': ['The Great Gatsby', 'To Kill a Mockingbird', '1984', 'Pride and Prejudice', 'The Catcher in the Rye'],
    'Author': ['F. Scott Fitzgerald', 'Harper Lee', 'George Orwell', 'Jane Austen', 'J.D. Salinger'],
    'Genre': ['Classic', 'Classic', 'Dystopian', 'Classic', 'Classic'],
    'Price': [10.99, 8.99, 7.99, 11.99, 9.99],
    'Copies Sold': [500, 600, 800, 300, 450]
}

df = pd.DataFrame(data)
df.head()
df.describe()
#df.info()
df.sort_values(by='Copies Sold')
df.groupby('Author')['Copies Sold'].sum()

Author
F. Scott Fitzgerald    500
George Orwell          800
Harper Lee             600
J.D. Salinger          450
Jane Austen            300
Name: Copies Sold, dtype: int64

Quel genre s’est le mieux vendu au total ?
Ou
Quel livre a généré le plus d’argent (Price × Copies Sold) ?

In [31]:
data = {
    'Book Title': ['The Great Gatsby', 'To Kill a Mockingbird', '1984', 'Pride and Prejudice', 'The Catcher in the Rye'],
    'Author': ['F. Scott Fitzgerald', 'Harper Lee', 'George Orwell', 'Jane Austen', 'J.D. Salinger'],
    'Genre': ['Classic', 'Classic', 'Dystopian', 'Classic', 'Classic'],
    'Price': [10.99, 8.99, 7.99, 11.99, 9.99],
    'Copies Sold': [500, 600, 800, 300, 450]
}

df = pd.DataFrame(data)
df.head()
df.describe()
#df.info()
df.sort_values(by='Copies Sold')
df.groupby('Author')['Copies Sold'].sum()
df.groupby('Genre')['Copies Sold'].sum().nlargest(1)
df[df['Copies Sold'] == df['Copies Sold'].max()]

  Book Title         Author      Genre  Price  Copies Sold
2       1984  George Orwell  Dystopian   7.99          800